{"files":[{"id":"d4cd38ef-7af3-4ce2-9b0a-95c79eda3804","name":"appsscript","type":"json","source":"{\n  \"timeZone\": \"Europe/Madrid\",\n  \"dependencies\": {\n  },\n  \"exceptionLogging\": \"STACKDRIVER\",\n  \"runtimeVersion\": \"V8\"\n}"},{"id":"8cbda0b4-0d7c-4166-aa7e-20c2f04003c0","name":"Código","type":"server_js","source":"function selector(text, opts) {\n  return opts[text] ?? \"User input\";\n}\n\nfunction pregunta1(text) {\n  return selector(text, {\n    \"Excel·lent / Excelente: (Ha respost de manera amable, sense faltes, la quantitat de paraules fetes servir eren les necessàries, no ha parlat de més. / Ha respondido de manera amable, sin faltas, la cantidad de palabras usadas eran las necesarias, no habló de más.)\": 5,\n    \"Bona / Buena: (Ha respost de manera correcta, amb poques faltes, la quantitat de paraules era apropiada. / Ha respondido de manera correcta, con pocas faltas, la cantidad de palabras era apropiada.)\": 4,\n    \"Regular: (Ha respost de manera acceptable, però amb algunes faltes i paraules innecessàries. / Ha respondido de manera aceptable, pero con algunas faltas y palabras innecesarias.):\": 3,\n    \"Dolenta / Mala: (Ha respost amb moltes faltes, i la quantitat de paraules era excessiva o molt baixa. / Ha respondido con muchas faltas, y la cantidad de palabras era excesiva o muy baja.)\": 2,\n    \"Molt Dolenta / Muy Mala: (La resposta no era comprensible o no era adequada, moltes faltes, massa paraules o massa poques. / La respuesta no era comprensible o no era adecuada, muchas faltas, demasiadas palabras o muy pocas.)\": 1\n  });\n}\n\nfunction pregunta2(text) {\n  return selector(text, {\n    \"Sí, molt informativa / Sí, muy informativa: (Les respostes eren clares i detallades, proporcionant tota la informació necessària. / Las respuestas eran claras y detalladas, proporcionando toda la información necesaria.)\": 4,\n    \"Sí, informativa: (Les respostes eren útils, però podrien ser més detallades. / Las respuestas eran útiles, pero podrían ser más detalladas.)\": 3,\n    \"Poc informativa / Poco informativa: (Les respostes eren vagues i no proporcionaven tota la informació necessària. / Las respuestas eran vagas y no proporcionaban toda la información necesaria.)\": 2,\n    \"Gens informativa / Nada informativa: (Les respostes no eren útils o no proporcionaven informació rellevant. / Las respuestas no eran útiles o no proporcionaban información relevante.)\": 1,\n  });\n}\n\nfunction count_for(text, lista, listb) {\n  var count \u003d 0;\n\n  for(var i \u003d 0; i \u003c lista.length; i++) {\n    var key \u003d lista[i];\n    var value \u003d listb[i];\n\n    if(key !\u003d text) continue;\n\n    var value_num \u003d parseInt(value);\n\n    if(isNaN(value_num)) continue;\n\n    if(value_num \u003c 0) continue;\n\n    count +\u003d value_num;\n  }\n\n  return count;\n}\n\nfunction count_for_over_n_avg(text, lista, listb) {\n  var count \u003d 0;\n\n  var n \u003d 0;\n\n  for(var i \u003d 0; i \u003c lista.length; i++) {\n    var key \u003d lista[i];\n    var value \u003d listb[i];\n\n    if(key !\u003d text) continue;\n\n    var value_num \u003d parseInt(value);\n\n    if(isNaN(value_num)) continue;\n\n    if(value_num \u003c 0) continue;\n\n    count +\u003d value_num;\n    n++;\n  }\n\n  return count / n;\n}"}]}